<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Selecting-Series-from-DataFrame" data-toc-modified-id="Selecting-Series-from-DataFrame-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Selecting Series from DataFrame</a></span></li><li><span><a href="#Single-Series" data-toc-modified-id="Single-Series-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Single Series</a></span></li><li><span><a href="#Multiple-Series" data-toc-modified-id="Multiple-Series-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Multiple Series</a></span><ul class="toc-item"><li><span><a href="#About-the-Author" data-toc-modified-id="About-the-Author-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>About the Author</a></span></li></ul></li></ul></div>

## Selecting Series from DataFrame

## Single Series

In [1]:
# conventional way to import pandas
import pandas as pd

In [2]:
# read a dataset of UFO reports into DataFrame 
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')

# read a csv is equivalent to read_table, except it assumes a comma separator 
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
# examine first 5 rows 
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
# select 'City' Series using bracket notation
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [ ]:
type(ufo['City'])

In [5]:
# select 'City' Series using dot(.) notation
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

__Note__
- Bracket notation will always work, whereas dot notation has **limitations**
- Dot notation doesn't work if there are **spaces** in the Series name
- Dot notation doesn't work if the Series has the same name as a **DataFrame method or attribute** (like 'head' or 'shape')
- Dot notation can't be used to define the name of a **new Series** (see below)

In [6]:
# create a new 'Location' Series (must use bracket notation to define the Series name)
ufo['Location'] = ufo.City + ', ' + ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

## Multiple Series

In [7]:
# select multiple series from dataframe 
ufo[['City', 'State', 'Time']]

                       City State              Time
0                    Ithaca    NY    6/1/1930 22:00
1               Willingboro    NJ   6/30/1930 20:00
2                   Holyoke    CO   2/15/1931 14:00
3                   Abilene    KS    6/1/1931 13:00
4      New York Worlds Fair    NY   4/18/1933 19:00
...                     ...   ...               ...
18236            Grant Park    IL  12/31/2000 23:00
18237           Spirit Lake    IA  12/31/2000 23:00
18238           Eagle River    WI  12/31/2000 23:45
18239           Eagle River    WI  12/31/2000 23:45
18240                  Ybor    FL  12/31/2000 23:59

[18241 rows x 3 columns]

<h3>About the Author</h3>
This repo was created by <a href="https://www.linkedin.com/in/jubayer28/" target="_blank">Jubayer Hossain</a> <br>
<a href="https://www.linkedin.com/in/jubayer28/" target="_blank">Jubayer Hossain</a> is a student of Microbiology at Jagannath University and the founder of <a href="https://github.com/hdro" target="_blank">Health Data Research Organization</a>. He is also a team member of a bioinformatics research group known as Bio-Bio-1. 

<a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/"><img alt="Creative Commons License" style="border-width:0" src="https://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png" /></a><br />This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License</a>.m